backend/app/models/user.rb

    def user_ingredients
        user = User.where(name: "Genevieve")[0]

        ingredients_ary = []

        user.user_products.map do |u_product|
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1  [["name", "Genevieve"]]
SELECT "user_products".* FROM "user_products" WHERE "user_products"."user_id" = $1  [["user_id", 13]]