backend/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
    def index
        render json: Ingredient.all

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 878], ["LIMIT", 1]]
---
    def show
        render json: Ingredient.find(params[:id])