backend/app/controllers/products_controller.rb

    def index
        render json: Product.all
---
SELECT "products".* FROM "products"

    def show
        render json: Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]