backend/app/controllers/product_ingredients_controller.rb

SELECT "product_ingredients".* FROM "product_ingredients"
---
    def index
        render json: ProductIngredient.all

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 878], ["LIMIT", 1]]
---
    def show
        render json: ProductIngredient.find(params[:id])