backend/app/controllers/user_products_controller.rb

SELECT "user_products".* FROM "user_products" WHERE "user_products"."user_id" = $1  [["user_id", 13]]
---
    def index
        render json: UserProduct.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
---
    def show
        render json: UserProduct.find(params[:id])